nathantgray/esp-idf-wwu/examples/esp32c6_temp_display/sdkconfig.defaults
# Default Build Configuration for ESP32-C6 Temperature Display

# Chip target
CONFIG_IDF_TARGET="esp32c6"

# Partition Table Configuration (use custom partitions.csv with 2MB app size)
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Provisioning Configuration
CONFIG_EXAMPLE_PROV_TRANSPORT_BLE=n
CONFIG_EXAMPLE_PROV_TRANSPORT_SOFTAP=y
CONFIG_EXAMPLE_PROV_SECURITY_VERSION_1=y

# NeoPixel Display Configuration  
CONFIG_NEOPIXEL_GPIO=2
CONFIG_NEOPIXEL_BRIGHTNESS=200

# MQTT Configuration - Update these with your Home Assistant details
CONFIG_MQTT_BROKER_URI="mqtt://homeassistant.local:1883"
CONFIG_MQTT_USERNAME="mqtt_user"
CONFIG_MQTT_PASSWORD="EWB"
CONFIG_MQTT_TEMP_TOPIC="pawsaver"

# WiFi Configuration
CONFIG_EXAMPLE_WIFI_SSID=""
CONFIG_EXAMPLE_WIFI_PASSWORD=""

# Logging
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# FreeRTOS
CONFIG_FREERTOS_TICK_RATE_HZ=1000

# Memory
CONFIG_SPIRAM=n

# Console
CONFIG_ESP_CONSOLE_UART_DEFAULT=y

# OTA Updates
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=n

# mDNS (optional, for .local hostname resolution)
CONFIG_MDNS_ENABLE=y

# JSON support
CONFIG_CJSON_USE_FILE=y

# MQTT Client
CONFIG_MQTT_TRANSPORT_SSL=n
CONFIG_MQTT_USE_CUSTOM_CONFIG=n
